{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,null,80,1],"dtype":"float32","sparse":false,"name":"conv2d_input"}},{"class_name":"Conv2D","config":{"filters":40,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d","trainable":true,"batch_input_shape":[null,null,80,1],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d","trainable":true}},{"class_name":"Conv2D","config":{"filters":60,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_1","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_1","trainable":true}},{"class_name":"Reshape","config":{"target_shape":[null,1200],"name":"reshape","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm","trainable":true,"units":200,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidi","trainable":true}},{"class_name":"Dense","config":{"units":22,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true}}]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"conv2d/kernel","shape":[3,3,1,40],"dtype":"float32"},{"name":"conv2d/bias","shape":[40],"dtype":"float32"},{"name":"conv2d_1/kernel","shape":[3,3,40,60],"dtype":"float32"},{"name":"conv2d_1/bias","shape":[60],"dtype":"float32"},{"name":"bidi/forward_lstm/kernel","shape":[1200,800],"dtype":"float32"},{"name":"bidi/forward_lstm/recurrent_kernel","shape":[200,800],"dtype":"float32"},{"name":"bidi/forward_lstm/bias","shape":[800],"dtype":"float32"},{"name":"bidi/backward_lstm/kernel","shape":[1200,800],"dtype":"float32"},{"name":"bidi/backward_lstm/recurrent_kernel","shape":[200,800],"dtype":"float32"},{"name":"bidi/backward_lstm/bias","shape":[800],"dtype":"float32"},{"name":"dense/kernel","shape":[400,22],"dtype":"float32"},{"name":"dense/bias","shape":[22],"dtype":"float32"}]}]}
